src/cf/InformationRegisters/ПорядокНалогообложенияТорговыхТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПорядокНалогообложенияТорговыхТочек</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОсобыйПорядокНалогообложения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/УдалитьСчетаУчетаВНТТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>УдалитьСчетаУчетаВНТТ</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетДоходовОтРеализации</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетРасходовОтРеализации</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректироватьСтоимостьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

src/cf/Enums/ТипыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыСкладов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОптовыйСклад</Name>
					<Comment> Оптовый склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозничныйМагазин</Name>
					<Comment> Розничный</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеавтоматизированнаяТорговаяТочка</Name>
					<Comment> Неавтоматизированная торговая точка</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийПКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПКО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозничнаяВыручка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПодотчетногоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеНаличныхВБанке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеКредита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаймаКонтрагентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаймаРаботником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочийПриход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийОплатаПлатежнойКартой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОперацийОплатаПлатежнойКартой</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РозничнаяВыручка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПокупателю</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/Склады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Склады</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment> Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦенРозничнойТорговли</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСклада</Name>
					<Comment> Тип склада: оптовый, розничный, неавтоматизированная торговая точка</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСкладов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ПорядокНалогообложенияТорговыхТочек/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
Функция ОсобыйПорядокНалогообложенияНаСкладе(Склад, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПорядокНалогообложенияТорговыхТочекСрезПоследних.ОсобыйПорядокНалогообложения
	|ИЗ
	|	РегистрСведений.ПорядокНалогообложенияТорговыхТочек.СрезПоследних(&Дата, Склад = &Склад) КАК ПорядокНалогообложенияТорговыхТочекСрезПоследних";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 0 Тогда 
		Возврат Ложь;
	Иначе
		Возврат Результат[0].ОсобыйПорядокНалогообложения;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиОбновления

Процедура ЗаполнитьПорядокНалогообложенияТорговыхТочек() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПорядокНалогообложенияТорговыхТочек.Период,
	|	ПорядокНалогообложенияТорговыхТочек.Склад,
	|	ПорядокНалогообложенияТорговыхТочек.ОсобыйПорядокНалогообложения
	|ИЗ
	|	РегистрСведений.ПорядокНалогообложенияТорговыхТочек КАК ПорядокНалогообложенияТорговыхТочек";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("КонецТекущегоГода", КонецГода(ТекущаяДата()));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Склады.Ссылка КАК Склад
	|ПОМЕСТИТЬ ВТ_Склады
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.НеавтоматизированнаяТорговаяТочка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПриходныйКассовыйОрдер.Ссылка КАК Регистратор,
	|	ПриходныйКассовыйОрдер.Контрагент КАК Склад
	|ПОМЕСТИТЬ ВТ_Документы
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|ГДЕ
	|	ПриходныйКассовыйОрдер.Проведен
	|	И ПриходныйКассовыйОрдер.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.РозничнаяВыручка)
	|	И ПриходныйКассовыйОрдер.Контрагент В
	|			(ВЫБРАТЬ
	|				ВТ_Склады.Склад
	|			ИЗ
	|				ВТ_Склады)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОплатаПлатежнойКартой.Ссылка,
	|	ОплатаПлатежнойКартой.Контрагент
	|ИЗ
	|	Документ.ОплатаПлатежнойКартой КАК ОплатаПлатежнойКартой
	|ГДЕ
	|	ОплатаПлатежнойКартой.Проведен
	|	И ОплатаПлатежнойКартой.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОплатаПлатежнойКартой.РозничнаяВыручка)
	|	И ОплатаПлатежнойКартой.Контрагент В
	|			(ВЫБРАТЬ
	|				ВТ_Склады.Склад
	|			ИЗ
	|				ВТ_Склады)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Склады.Склад КАК Склад
	|ИЗ
	|	ВТ_Склады КАК ВТ_Склады
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(УдалитьСчетаУчетаВНТТ.Период, МЕСЯЦ) КАК Период,
	|	УдалитьСчетаУчетаВНТТ.ТорговаяТочка КАК Склад,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА УдалитьСчетаУчетаВНТТ.СчетДоходовОтРеализации = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыручкаЕНВД)
	|					ИЛИ УдалитьСчетаУчетаВНТТ.СчетРасходовОтРеализации = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажЕНВД)
	|				ТОГДА ИСТИНА
	|			КОГДА УдалитьСчетаУчетаВНТТ.СчетДоходовОтРеализации = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыручкаНеЕНВД)
	|					ИЛИ УдалитьСчетаУчетаВНТТ.СчетРасходовОтРеализации = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ОсобыйПорядокНалогообложения,
	|	КОНЕЦПЕРИОДА(ВЫБОР
	|			КОГДА ВТ_СоответствиеПериодов.ПериодСледующий ЕСТЬ NULL 
	|					И УдалитьСчетаУчетаВНТТ.Период <= &КонецТекущегоГода
	|				ТОГДА &КонецТекущегоГода
	|			КОГДА ВТ_СоответствиеПериодов.ПериодСледующий ЕСТЬ NULL 
	|					И УдалитьСчетаУчетаВНТТ.Период > &КонецТекущегоГода
	|				ТОГДА КОНЕЦПЕРИОДА(УдалитьСчетаУчетаВНТТ.Период, ГОД)
	|			ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ВТ_СоответствиеПериодов.ПериодСледующий, ДЕНЬ), СЕКУНДА, -1)
	|		КОНЕЦ, МЕСЯЦ) КАК ПериодПо
	|ИЗ
	|	РегистрСведений.УдалитьСчетаУчетаВНТТ КАК УдалитьСчетаУчетаВНТТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			УдалитьСчетаУчетаВНТТ1.Период КАК ПериодТекущий,
	|			УдалитьСчетаУчетаВНТТ1.ТорговаяТочка КАК ТорговаяТочка,
	|			МИНИМУМ(УдалитьСчетаУчетаВНТТ2.Период) КАК ПериодСледующий
	|		ИЗ
	|			РегистрСведений.УдалитьСчетаУчетаВНТТ КАК УдалитьСчетаУчетаВНТТ1
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УдалитьСчетаУчетаВНТТ КАК УдалитьСчетаУчетаВНТТ2
	|				ПО УдалитьСчетаУчетаВНТТ1.ТорговаяТочка = УдалитьСчетаУчетаВНТТ2.ТорговаяТочка
	|					И УдалитьСчетаУчетаВНТТ1.Период < УдалитьСчетаУчетаВНТТ2.Период
	|		
	|		СГРУППИРОВАТЬ ПО
	|			УдалитьСчетаУчетаВНТТ1.Период,
	|			УдалитьСчетаУчетаВНТТ1.ТорговаяТочка) КАК ВТ_СоответствиеПериодов
	|		ПО УдалитьСчетаУчетаВНТТ.ТорговаяТочка = ВТ_СоответствиеПериодов.ТорговаяТочка
	|			И УдалитьСчетаУчетаВНТТ.Период = ВТ_СоответствиеПериодов.ПериодТекущий
	|
	|СГРУППИРОВАТЬ ПО
	|	УдалитьСчетаУчетаВНТТ.ТорговаяТочка,
	|	НАЧАЛОПЕРИОДА(УдалитьСчетаУчетаВНТТ.Период, МЕСЯЦ),
	|	КОНЕЦПЕРИОДА(ВЫБОР
	|			КОГДА ВТ_СоответствиеПериодов.ПериодСледующий ЕСТЬ NULL 
	|					И УдалитьСчетаУчетаВНТТ.Период <= &КонецТекущегоГода
	|				ТОГДА &КонецТекущегоГода
	|			КОГДА ВТ_СоответствиеПериодов.ПериодСледующий ЕСТЬ NULL 
	|					И УдалитьСчетаУчетаВНТТ.Период > &КонецТекущегоГода
	|				ТОГДА КОНЕЦПЕРИОДА(УдалитьСчетаУчетаВНТТ.Период, ГОД)
	|			ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ВТ_СоответствиеПериодов.ПериодСледующий, ДЕНЬ), СЕКУНДА, -1)
	|		КОНЕЦ, МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(Хозрасчетный.Период, МЕСЯЦ) КАК Период,
	|	Хозрасчетный.Организация КАК Организация,
	|	ВТ_Документы.Склад КАК Склад,
	|	ИСТИНА КАК ОсобыйПорядокНалогообложения,
	|	КОНЕЦПЕРИОДА(Хозрасчетный.Период, МЕСЯЦ) КАК ПериодПо
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Документы КАК ВТ_Документы
	|		ПО Хозрасчетный.Регистратор = ВТ_Документы.Регистратор
	|ГДЕ
	|	Хозрасчетный.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыручкаЕНВД)
	|	И Хозрасчетный.Регистратор В
	|			(ВЫБРАТЬ
	|				ВТ_Документы.Регистратор
	|			ИЗ
	|				ВТ_Документы)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Документы.Склад,
	|	Хозрасчетный.Организация,
	|	НАЧАЛОПЕРИОДА(Хозрасчетный.Период, МЕСЯЦ),
	|	КОНЕЦПЕРИОДА(Хозрасчетный.Период, МЕСЯЦ)";
	
	Результат = Запрос.ВыполнитьПакет();
	НТТ_Склады          = Результат[2].Выгрузить();
	НТТ_СчетаУчета      = Результат[3].Выгрузить(); // исходная таблица
	НТТ_Движения        = Результат[4].Выгрузить();
	
	МассивСтрокКУдалению_НТТ_Движения = Новый Массив();
	
	Для Каждого СтрокаТаблицы ИЗ НТТ_Склады Цикл
		
		ОтборНТТ = Новый Структура("Склад", СтрокаТаблицы.Склад);
		МассивСтрокНТТ = НТТ_Движения.НайтиСтроки(ОтборНТТ);
		Для Каждого СтрокаМассиваНТТ ИЗ МассивСтрокНТТ Цикл
			ОтборПериод = Новый Структура("Склад", СтрокаМассиваНТТ.Склад);
			МассивСтрокПериод = НТТ_СчетаУчета.НайтиСтроки(ОтборПериод);
			Если МассивСтрокПериод.Количество() <> 0 Тогда
				Для Каждого СтрокаМассиваНТТПериод ИЗ МассивСтрокПериод Цикл
					Если СтрокаМассиваНТТ.Период >= СтрокаМассиваНТТПериод.Период
						И СтрокаМассиваНТТ.ПериодПо <= СтрокаМассиваНТТПериод.ПериодПо Тогда
						
						МассивСтрокКУдалению_НТТ_Движения.Добавить(СтрокаМассиваНТТ);
						
						Если СтрокаМассиваНТТ.ОсобыйПорядокНалогообложения = СтрокаМассиваНТТПериод.ОсобыйПорядокНалогообложения Тогда
							Продолжить;
						КонецЕсли;
						
						Если СтрокаМассиваНТТ.Период = СтрокаМассиваНТТПериод.Период
							И СтрокаМассиваНТТ.ПериодПо = СтрокаМассиваНТТПериод.ПериодПо Тогда
							СтрокаМассиваНТТПериод.ОсобыйПорядокНалогообложения = СтрокаМассиваНТТ.ОсобыйПорядокНалогообложения;
						Иначе
							ПериодПо = СтрокаМассиваНТТПериод.ПериодПо;
							
							Если СтрокаМассиваНТТ.Период = СтрокаМассиваНТТПериод.Период Тогда
								НоваяСтрока = СтрокаМассиваНТТПериод;
							Иначе
								НоваяСтрока = НТТ_СчетаУчета.Добавить();
								СтрокаМассиваНТТПериод.ПериодПо = КонецМесяца(ДобавитьМесяц(СтрокаМассиваНТТ.Период, -1));
							КонецЕсли;
							ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассиваНТТ);
							
							Если СтрокаМассиваНТТ.ПериодПо <> ПериодПо Тогда
								НоваяСтрока                              = НТТ_СчетаУчета.Добавить();
								НоваяСтрока.Склад                        = СтрокаМассиваНТТ.Склад;
								НоваяСтрока.Период                       = НачалоМесяца(ДобавитьМесяц(СтрокаМассиваНТТ.Период, 1));
								НоваяСтрока.ПериодПо                     = ПериодПо;
								НоваяСтрока.ОсобыйПорядокНалогообложения = НЕ СтрокаМассиваНТТ.ОсобыйПорядокНалогообложения;
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
				КонецЦикла;
			Иначе
				
				МассивСтрокКУдалению_НТТ_Движения.Добавить(СтрокаМассиваНТТ);
				
				НоваяСтрока = НТТ_СчетаУчета.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассиваНТТ);
				
				НоваяСтрока                              = НТТ_СчетаУчета.Добавить();
				НоваяСтрока.Склад                        = СтрокаМассиваНТТ.Склад;
				НоваяСтрока.Период                       = НачалоМесяца(ДобавитьМесяц(СтрокаМассиваНТТ.Период, 1));
				НоваяСтрока.ПериодПо                     = КонецМесяца(ДобавитьМесяц(СтрокаМассиваНТТ.Период, 1));
				НоваяСтрока.ОсобыйПорядокНалогообложения = НЕ СтрокаМассиваНТТ.ОсобыйПорядокНалогообложения;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого СтрокаКУдалению ИЗ МассивСтрокКУдалению_НТТ_Движения Цикл
		НТТ_Движения.Удалить(СтрокаКУдалению);
	КонецЦикла;
	
	Если НТТ_Движения.Количество() <> 0 Тогда
		Для Каждого СтрокаТаблицы ИЗ НТТ_Движения Цикл
			
			ОтборПериод = Новый Структура("Период, Склад", СтрокаТаблицы.Период, СтрокаТаблицы.Склад);
			МассивСтрокПериод = НТТ_СчетаУчета.НайтиСтроки(ОтборПериод);
			Если МассивСтрокПериод.Количество() = 0 Тогда
				НоваяСтрока = НТТ_СчетаУчета.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			КонецЕсли;
			
			Период = НачалоМесяца(ДобавитьМесяц(СтрокаТаблицы.Период, 1));
			ОтборПериод = Новый Структура("Период, Склад", Период, СтрокаТаблицы.Склад);
			МассивСтрокПериод = НТТ_СчетаУчета.НайтиСтроки(ОтборПериод);
			Если МассивСтрокПериод.Количество() = 0 Тогда
				НоваяСтрока                              = НТТ_СчетаУчета.Добавить();
				НоваяСтрока.Склад                        = СтрокаТаблицы.Склад;
				НоваяСтрока.Период                       = Период;
				НоваяСтрока.ОсобыйПорядокНалогообложения = НЕ СтрокаТаблицы.ОсобыйПорядокНалогообложения;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	НТТ_СчетаУчета.Свернуть("Период, Склад, ОсобыйПорядокНалогообложения");
	
	Набор = РегистрыСведений.ПорядокНалогообложенияТорговыхТочек.СоздатьНаборЗаписей();
	Набор.Загрузить(НТТ_СчетаУчета);
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(Набор);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
